*** Org-Mode Configuration for Babel/Code Block Support.
Set some Org-Mode functionality up so that code blocks work better.

#+BEGIN_SRC emacs-lisp
  (use-package org			; load org mode
    :ensure t
    :config (setq org-src-tab-acts-natively t)
    :config (org-babel-do-load-languages
	     'org-babel-load-languages
	     '(
	       (python . t)
	       (C . t)
	       (shell . t)
	       (latex . t)
	       ))
    ;; fontify the code in Org Mode Code Blocks
    :config (setq org-src-fontify-natively t)
    ;; Don't check before running the code.
    :config (setq org-confirm-babel-evaluate nil))
#+END_SRC

This code block sets up the fact that you can write your code in
various languages and have Org run them as you would expect. Testing
on how this works is required, but a quick Python 'Hello World'
example functions.

For Python there is a page of examples here:
https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-python.html#orgd68ccfd

#+BEGIN_SRC python :results output
  print "Hello World!"
#+END_SRC

#+RESULTS:
: Hello World!

To run the code block place the cursor in the block and hit C-c C-c.

